// Homework5.5.2.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>

template<class T>
class table
{
protected:
    T** arr;
public:
    table(int rows, int cols) 
    {
        arr = new T* [rows];
        for (int a = 0; a < rows; ++a) {
            arr[a] = new T[cols];
        }
    };
    T* operator[](const int i)
    {
        return arr[i];
    }
    //table(const table&) = delete; //при добавлении этой функции программа падает, т.к. ссылается на функцию которая удалена
    table& operator=(const table&) = delete;
};

int main(int argc, char** argv)
{
    setlocale(LC_ALL, "Russian");

    auto test = table<double>(2, 3);
    auto test2 = test;
    test[0][0] = 4;
    std::cout << test[0][0]; // выводит 4
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
